app/views/jobs/_form.html.erb

SELECT "tags".* FROM "tags"
---
      <%= link_to 'Manage Tags (Add or Delete a tag)', tags_path %><br/>
      <%= j.select :tags, Tag.all.collect {|x| [x.tag, x.id]}, {selected: @job.tags.all.collect{ |x| x.id} }, :multiple => true %>

SELECT "fields".* FROM "fields"
---
      <%= j.label :field %><br />
        <%= collection_select(:job, :field_id, Field.all, :id, :name, {disabled: nil}) %>