app/views/jobseekers/index.html.erb

        <td><%= job.deadline %></td>
        <td> <% job.applies.each do |a|
---
SELECT "applies".* FROM "applies"  WHERE "applies"."job_id" = ?  [["job_id", 12]]