app/views/searches/index.html.erb

SELECT "fields".* FROM "fields"
---
    <%= text_field_tag :keywords, placeholder = "Title or Description" %>
    <%= select_tag(:field_id, options_for_select([['', 0]]) + options_from_collection_for_select(Field.all, :id, :name,  params[:field_id])) %>