app/controllers/applies_controller.rb

  def create
    @apply = Apply.new(apply_params)
    @apply.job_id = apply_params[:job_id]
    @apply.user_id = session[:user_id]
    respond_to do |format|
      if @apply.save
---
INSERT INTO "applies" ("cover", "created_at", "job_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["cover", "i like it"], ["created_at", "2014-10-08 00:30:20.192636"], ["job_id", 13], ["updated_at", "2014-10-08 00:30:20.192636"], ["user_id", 980190972]]

    def set_apply
      @apply = Apply.find(params[:id])
---
SELECT  "applies".* FROM "applies"  WHERE "applies"."id" = ? LIMIT 1  [["id", 26]]