app/controllers/fields_controller.rb

SELECT "fields".* FROM "fields"
---
  def index
    @fields = Field.all