app/controllers/jobs_controller.rb

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = 0 LIMIT 1
---
  def create
    @job = Job.new(field_params)
    # associate this job posting with the currently logged in user
    @job.employee_id = session[:user_id]
    @job.isDeleted = false
    if @job.save
      # TODO: find a way to have rails do this
      # then add all the tags back
      params[:job][:tags].each do |x|
        @tag = Tag.find_by_id(x)