app/controllers/jobseekers_controller.rb

  def index
    @jobs = Job.all
    @fields = Field.all
    @applies = Apply.all
    @ap = Apply.pluck(:job_id)
---
SELECT "fields".* FROM "fields"
SELECT "applies".* FROM "applies"  WHERE "applies"."job_id" = ?  [["job_id", 12]]
SELECT "applies"."job_id" FROM "applies"

  def new
    @jobs = Job.all
    @fields = Field.all
    @applies = Apply.all
    @ap = Apply.pluck(:job_id)
---
SELECT "applies"."job_id" FROM "applies"