app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"  WHERE (isDeleted = 'f')

  def create
    @user = User.new(field_params)
    # Dont allow the field_param to set the user_role to whatever they would like, only use one of the values we allow.
    role = field_params[:role]
    if role == User.EMP_ROLE then
      @user.role = User.EMP_ROLE
    elsif role == User.ADM_ROLE then
      @user.role = User.ADM_ROLE
    else
      @user.role = User.USR_ROLE
    end
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("contactName", "created_at", "email", "name", "password_digest", "phone", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(field_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 980190972  [["name", "useruser"], ["updated_at", "2014-10-03 03:44:54.440127"]]

  def set_field
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 980190972]]